/**
 * 算法描述计算过程，把问题抽象分类，可以得出一些常用操作的计算方法，当然算法不能脱离数据结构（数据组织形式）---好像从这里也能
 * 发现中国哲学辩证（统一）法的思想
 * 算法效率分析基础
 * -- 输入规模,发现基本操作,执行次数与渐进表示法  最优最差效率分析 平均效率 级数求和 极限--函数增长次数比较
 * -- 如果基本操作不止依赖于输入规模,同时还依赖一些其他的特性,则最差效率,平均效率以及最优效率需要分别研究.
 * 排序问题
 * -- 随机数
 * -- 初级排序、快排、归并等
 * -- 排序网络？
 * 分治法
 * -- 将问题划分成一些独立的子问题，递归求解各子问题，然后合并子问题的解而得到原问题的解
 * 动态规划
 * -- 适用于子问题不是独立（独立时，可以分别递归）的情况，该算法对每个子问题只求解一次，将其结果保存在一张表中(eg.字符串匹配)，
 *    从而避免每次遇到子问题时从新计算答案。动态规划通常应用于【最优化问题】。
 * 贪心算法
 * -- 期望通过所做的局部最优选择来产生一个全局最优解。
 * -- 赫夫曼编码的应用
 * 图算法
 * -- BFS、DFS
 * 字符串匹配
 * -- 动态规划
 * -- 形式语言与有限自动机
 *
 * 算法问题选编
 * -- 数论相关
 * -- 计算与复杂性理论
 * -- NP完全性
 * -- 近似算法
 *
 * 参考资料
 * 算法设计与分析基础
 * 算法分析导论
 * 算法导论
 * 算法
 * 计算机程序设计艺术--共四卷
 */
package org.pp.java8.algorithm;